// @strict-types

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ФондКниг.Записывать = Истина;

	Для Каждого Строка Из Экземпляры Цикл

		Движение = Движения.ФондКниг.Добавить();
		Движение.ВидДвижения   = ВидДвиженияНакопления.Расход;
		Движение.Период        = Дата;
		Движение.Книга         = Строка.Книга;
		Движение.МестоХранения = Строка.МестоХранения;
		Движение.Состояние     = "";
		Движение.Количество    = Строка.Количество;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Движения.ФондКниг.Записывать = Истина;

КонецПроцедуры

#КонецОбласти
